{
    '高喷旋喷桩': {
        'id': '01-2-1-20',
        'desc': '成孔',
        'unit': 'm',
        'detail': {
                '人工': [
                    {
                        'type': '打桩工',
                        'id': 30113,
                        'unit': '工日',
                        'amount': 0.0808
                    }
                ],
                '材料': [
                    {
                        'type': '水',
                        'id': 34110101,
                        'unit': 'm3',
                        'amount': 0.1189
                    }
                ],
                '机械': [
                    {
                        'type': '电动多级离心清水泵 fi100*120m下',
                        'id': 99440130,
                        'unit': '台班',
                        'amount': 0.0202
                    },
                    {
                        'type': '钻机 XY100',
                        'id': 99030614,
                        'unit': '台班',
                        'amount': 0.0202
                    }
                ]
            }
        }
}